package ru.vkontakte.gwt.client;

/**
 * TODO Implement me! 
 */	
public class VKAppService {
/*	Методы сервиса предложений
	offers.edit – сохраняет информацию о предложении пользователя.
	offers.open – открывает предложение пользователя для общего доступа.
	offers.close – закрывает предложение пользователя.
	offers.get – возвращает информацию о предложении пользователя.
	offers.search – возвращает информацию о случайном предложении в соответствии с выбранными фильтрами.
	offers.getInboundResponses – возвращает информацию об ответах на предложение пользователя.
	offers.getOutboundResponses – возвращает информацию об ответах пользователя на другие предложения.
	offers.accept – принимает предложение.
	offers.refuse – отклоняет предложение.
	offers.setResponseViewed – отмечает ответы на предложение пользователя как просмотренные.
	offers.deleteResponses – удаляет ответы на предложение пользователя.
*/
}
