package ru.vkontakte.gwt.client;

/**
 * TODO Implement me! 
 */	
public class VKAudio {
/*
  	Аудиозаписи
	audio.get – возвращает список аудиозаписей пользователя или группы.
	audio.getById – возвращает информацию об аудиозаписях по их идентификаторам.
	audio.getLyrics - возвращает текст аудиозаписи.
	audio.getUploadServer – возвращает адрес сервера для загрузки аудиозаписей.
	audio.save – сохраняет аудиозаписи после успешной загрузки.
	audio.search – осуществляет поиск по аудиозаписям.
	audio.add – копирует существующую аудиозапись на страницу пользователя или группы.
	audio.delete – удаляет аудиозапись со страницы пользователя или группы.
	audio.editnew – редактирует аудиозапись пользователя или группы.
	audio.restorenew – восстанавливает удаленную аудиозапись пользователя или группы.
	audio.reordernew – изменяет порядок аудиозаписи в списке аудиозаписей пользователя.

 */
}
