package ru.vkontakte.gwt.client;

/**
 * TODO Implement me! 
 */	
public class VKHelper {
/*	
	Методы, требующие наличия стороннего сервера
	secure.sendNotification – отправляет уведомление пользователю.
	secure.saveAppStatus – сохраняет строку статуса приложения для последующего вывода в общем списке приложений на странице пользоваетеля.
	secure.getAppStatus – возвращает строку статуса приложения, сохранённую при помощи secure.saveAppStatus.
	secure.getAppBalance – возвращает платежный баланс приложения.
	secure.getBalance – возвращает баланс пользователя на счету приложения.
	secure.withdrawVotes – списывает голоса со счета пользователя на счет приложения.
	secure.getTransactionsHistory – возвращает историю транзакций внутри приложения.
	secure.addRating – поднимает пользователю рейтинг от имени приложения.
	secure.setCounter – устанавливает счетчик, который выводится пользователю жирным шрифтом в левом меню, если он добавил приложение в левое меню.


	Другие методы
	executenew - позволяет исполнять алгоритмы в API.
	getVariable – возвращает значение хранимой переменной.
	getVariables – возвращает значения нескольких переменных.
	putVariable – записывает значение переменной.
	getHighScores – возвращает таблицу рекордов.
	setUserScore – записывает результат текущего пользователя в таблицу рекордов.
	getMessages – возвращает список очереди сообщений.
	sendMessage – ставит сообщение в очередь.
	getServerTime – возвращает текущее время.
	getAds – возвращает рекламные объявления для показа пользователям.
	setNameInMenunew – устанавливает короткое название приложения в левом меню, если пользователь добавил туда приложение.
*/	
}
