package ru.vkontakte.gwt.client;

/**
 * TODO Implement me! 
 */	
public class VKVideo {
/*
 	Видеозаписи
	video.get – Возвращает информацию о видеозаписях.
	video.editnew– редактирует данные видеозаписи на странице пользователя.
	video.addnew– копирует видеозапись на страницу пользователя.
	video.deletenew– удаляет видеозапись со страницы пользователя.
	video.searchnew– возвращает список видеозаписей в соответствии с заданным критерием поиска.
	video.getUserVideosnew– возвращает список видеозаписей, на которых отмечен пользователь.
	video.getCommentsnew– возвращает список комментариев к видеозаписи.
	video.createCommentnew– создает новый комментарий к видеозаписи.
	video.editCommentnew– изменяет текст комментария к видеозаписи.
	video.deleteCommentnew– удаляет комментарий к видеозаписи.
	video.getTagsnew– возвращает список отметок на видеозаписи.
	video.putTagnew– добавляет отметку на видеозапись.
	video.removeTagnew– удаляет отметку с видеозаписи.
	video.savenew – возвращает данные, необходимые для загрузки видеозаписей, а также данные видеозаписи.

 */
}
